# 30 Days of R/Python: Day 4

# Day 4: Filtering Using .loc[]

In [2]:
# Import necessary packages
import pandas as pd

In [6]:
# Create a small practice data frame
my_cats = {
    "Names" : ["Puss", "TigerLilly", "MaryGold", "SnapDragon", "Morty", "Topaz"],
    "Status" : ["Angel", "Living", "Living", "Living", "Living", "Angel"],
    "Sex" : ["M", "F", "F", "M", "M", "F"],
    "Age" : [18, 15, 14, 11, 9, 16],
    "Nickname" : ["BoyBlue", "Tigs", "MerB", "Nappa", "MortMort", "Toaps"]
}

In [16]:
# Create data frame from my_cats dictionary
my_cats_df = pd.DataFrame(my_cats, index = ["Cat_1","Cat_2", "Cat_3", "Cat_4", "Cat_5", "Cat_6"])
print(my_cats_df)

            Names  Status Sex  Age  Nickname
Cat_1        Puss   Angel   M   18   BoyBlue
Cat_2  TigerLilly  Living   F   15      Tigs
Cat_3    MaryGold  Living   F   14      MerB
Cat_4  SnapDragon  Living   M   11     Nappa
Cat_5       Morty  Living   M    9  MortMort
Cat_6       Topaz   Angel   F   16     Toaps

# Filtering Rows

In [17]:
# Select the first row using .loc[] (label-based indexing)
my_cats_df.loc["Cat_1"]

Names          Puss
Status        Angel
Sex               M
Age              18
Nickname    BoyBlue
Name: Cat_1, dtype: object

In [18]:
# Select multiple rows using .loc[]
my_cats_df.loc[["Cat_1", "Cat_3"]]

          Names  Status Sex  Age Nickname
Cat_1      Puss   Angel   M   18  BoyBlue
Cat_3  MaryGold  Living   F   14     MerB

In [19]:
# Select a slice of rows using .loc[]
my_cats_df.loc["Cat_3":"Cat_5"]

            Names  Status Sex  Age  Nickname
Cat_3    MaryGold  Living   F   14      MerB
Cat_4  SnapDragon  Living   M   11     Nappa
Cat_5       Morty  Living   M    9  MortMort

In [14]:
# Select rows based on a condition using .loc[]
my_cats_df.loc[my_cats_df["Age"] > 15]

   Names Status Sex  Age Nickname
0   Puss  Angel   M   18  BoyBlue
5  Topaz  Angel   F   16    Toaps

# Filtering Columns

In [23]:
# Select the first column using .loc[]
my_cats_df.loc[ :, "Names"]

Cat_1          Puss
Cat_2    TigerLilly
Cat_3      MaryGold
Cat_4    SnapDragon
Cat_5         Morty
Cat_6         Topaz
Name: Names, dtype: object

In [26]:
# Select multiple columns using .loc[]
my_cats_df.loc[ :, ["Names", "Age", "Nickname"]]

            Names  Age  Nickname
Cat_1        Puss   18   BoyBlue
Cat_2  TigerLilly   15      Tigs
Cat_3    MaryGold   14      MerB
Cat_4  SnapDragon   11     Nappa
Cat_5       Morty    9  MortMort
Cat_6       Topaz   16     Toaps

In [27]:
# Select a slice of colunms using .loc[]
my_cats_df.loc[ :, "Status" : "Age"]

       Status Sex  Age
Cat_1   Angel   M   18
Cat_2  Living   F   15
Cat_3  Living   F   14
Cat_4  Living   M   11
Cat_5  Living   M    9
Cat_6   Angel   F   16

# Filtering Rows and Columns

In [30]:
# Combine row and column selection using .loc[]

In [31]:
my_cats_df.loc["Cat_2" : "Cat_4" , ["Names", "Age","Nickname"]]

            Names  Age Nickname
Cat_2  TigerLilly   15     Tigs
Cat_3    MaryGold   14     MerB
Cat_4  SnapDragon   11    Nappa

# Summary

.loc selects data using row and column names (labels)